Extensions/ИнтеграцияGreenApi/Catalogs/iga_ШаблоныСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>iga_ШаблоныСообщений</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Утвержден</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуютсяКнопки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:EnumRef.iga_КатегорииШаблонов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткоеОписание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>180</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Язык</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.iga_ЯзыкиЧатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.iga_СтатусыПодтвержденияШаблонов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяШаблона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОшибкаШаблона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступенДляВыбора</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСодержимого</Name>
					<Type>
						<v8:Type>cfg:EnumRef.iga_ТипыСодержимогоШаблона</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаИзображение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеШаблона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпециальнаяМетка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.iga_СпециальныеМетки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПодготовки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверочныйКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПослеОтправки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверочныйКодПослеОтправки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Кнопки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.iga_ТипыКнопокСообщения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заголовок</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПримера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПараметрКнопки</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Подразделения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.iga_ПодразделенияОператоров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыШаблона</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеИсточник</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПримера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/InformationRegisters/iga_ПредопределенныеШаблоны.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>iga_ПредопределенныеШаблоны</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.iga_ШаблоныСообщений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АлгоритмДляОповещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.iga_Алгоритмы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидШаблона</Name>
					<Type>
						<v8:Type>cfg:EnumRef.iga_ВидыПредопределенныхШаблонов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Язык</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.iga_ЯзыкиЧатов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/Enums/iga_ТипыСодержимогоШаблона.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>iga_ТипыСодержимогоШаблона</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Текст</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Изображение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/Catalogs/iga_ШаблоныСообщений/Ext/ManagerModule.bsl
Функция ОтправитьСообщение(ЧатСсылка, ИдЧата, Шаблон, ВходящиеПараметры = Неопределено, ПростоеСообщение = Ложь, КартинкаШаблона = Неопределено) Экспорт 
	
	Если ВходящиеПараметры = Неопределено Тогда
		ВходящиеПараметры = Новый Структура;
	КонецЕсли;
	ИдШаблона = Неопределено;
	ШаблонСсылка = Неопределено;
	ПредопределенныйШаблон = Неопределено;
	
	Если ТипЗнч(Шаблон) = Тип("Строка") Тогда 
		ИдШаблона = Шаблон;
	КонецЕсли;
	Если ТипЗнч(Шаблон) = Тип("СправочникСсылка.iga_ШаблоныСообщений") Тогда 
		ШаблонСсылка = Шаблон;
	КонецЕсли;
	Если ТипЗнч(Шаблон) = Тип("ПеречислениеСсылка.iga_ВидыПредопределенныхШаблонов") Тогда 
		ПредопределенныйШаблон = Шаблон;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	iga_ПредопределенныеШаблоны.ВидШаблона КАК ВидШаблона,
	               |	iga_ПредопределенныеШаблоны.Шаблон КАК Шаблон,
	               |	iga_ПредопределенныеШаблоны.Язык КАК Язык
	               |ПОМЕСТИТЬ ВТ_ПредопределенныеШаблоны
	               |ИЗ
	               |	РегистрСведений.iga_ПредопределенныеШаблоны КАК iga_ПредопределенныеШаблоны
	               |ГДЕ
	               |	iga_ПредопределенныеШаблоны.ВидШаблона = &ПредопределенныйШаблон
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Шаблоны.Ссылка КАК Ссылка,
	               |	Шаблоны.Идентификатор КАК ИдШаблона,
	               |	Шаблоны.ТекстСообщения КАК ТекстСообщения,
	               |	Шаблоны.ТипСодержимого КАК ТипСодержимого,
	               |	ЕСТЬNULL(ВложенныйЗапрос.СсылкаНаФайл, Шаблоны.СсылкаНаИзображение) КАК СсылкаНаИзображение,
	               |	Шаблоны.Кнопки.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		Тип КАК Тип,
	               |		Заголовок КАК Заголовок,
	               |		Значение КАК Значение,
	               |		ЗначениеПримера КАК ЗначениеПримера,
	               |		ПараметрКнопки КАК ПараметрКнопки
	               |	) КАК Кнопки,
	               |	Шаблоны.АлгоритмПодготовки КАК АлгоритмПодготовки,
	               |	Шаблоны.АлгоритмПослеОтправки КАК АлгоритмПослеОтправки
	               |ИЗ
	               |	Справочник.iga_ШаблоныСообщений КАК Шаблоны
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			iga_ДополнительныеФайлы.СсылкаНаФайл КАК СсылкаНаФайл
	               |		ИЗ
	               |			Справочник.iga_ДополнительныеФайлы КАК iga_ДополнительныеФайлы
	               |		ГДЕ
	               |			iga_ДополнительныеФайлы.Ссылка = &КартинкаШаблона) КАК ВложенныйЗапрос
	               |		ПО (ИСТИНА)
	               |ГДЕ
	               |	(Шаблоны.Ссылка = &Ссылка
	               |			ИЛИ Шаблоны.Идентификатор = &ИдШаблона
	               |			ИЛИ ВЫБОР
	               |				КОГДА Шаблоны.Ссылка В
	               |						(ВЫБРАТЬ
	               |							ВТ_ПредопределенныеШаблоны.Шаблон КАК Шаблон
	               |						ИЗ
	               |							ВТ_ПредопределенныеШаблоны КАК ВТ_ПредопределенныеШаблоны
	               |						ГДЕ
	               |							ВТ_ПредопределенныеШаблоны.Язык = &Язык)
	               |					ТОГДА ИСТИНА
	               |				КОГДА Шаблоны.Ссылка В
	               |						(ВЫБРАТЬ
	               |							ВТ_ПредопределенныеШаблоны.Шаблон КАК Шаблон
	               |						ИЗ
	               |							ВТ_ПредопределенныеШаблоны КАК ВТ_ПредопределенныеШаблоны
	               |						ГДЕ
	               |							ВТ_ПредопределенныеШаблоны.Язык = &ПустойЯзык)
	               |					ТОГДА ИСТИНА
	               |				ИНАЧЕ ЛОЖЬ
	               |			КОНЕЦ)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Шаблоны.Номер КАК Номер,
	               |	""{"" + Шаблоны.ИмяПараметра + ""}"" КАК ИмяПараметра,
	               |	Шаблоны.ЗначениеИсточник КАК ЗначениеИсточник,
	               |	Шаблоны.ЗначениеИсточник.Алгоритм КАК Алгоритм
	               |ИЗ
	               |	Справочник.iga_ШаблоныСообщений.ПараметрыШаблона КАК Шаблоны
	               |ГДЕ
	               |	(Шаблоны.Ссылка = &Ссылка
	               |			ИЛИ Шаблоны.Ссылка.Идентификатор = &ИдШаблона
	               |			ИЛИ ВЫБОР
	               |				КОГДА Шаблоны.Ссылка В
	               |						(ВЫБРАТЬ
	               |							ВТ_ПредопределенныеШаблоны.Шаблон КАК Шаблон
	               |						ИЗ
	               |							ВТ_ПредопределенныеШаблоны КАК ВТ_ПредопределенныеШаблоны
	               |						ГДЕ
	               |							ВТ_ПредопределенныеШаблоны.Язык = &Язык)
	               |					ТОГДА ИСТИНА
	               |				КОГДА Шаблоны.Ссылка В
	               |						(ВЫБРАТЬ
	               |							ВТ_ПредопределенныеШаблоны.Шаблон КАК Шаблон
	               |						ИЗ
	               |							ВТ_ПредопределенныеШаблоны КАК ВТ_ПредопределенныеШаблоны
	               |						ГДЕ
	               |							ВТ_ПредопределенныеШаблоны.Язык = &ПустойЯзык)
	               |					ТОГДА ИСТИНА
	               |				ИНАЧЕ ЛОЖЬ
	               |			КОНЕЦ)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Номер";
	Запрос.УстановитьПараметр("ПредопределенныйШаблон", ПредопределенныйШаблон);
	Запрос.УстановитьПараметр("Ссылка", ШаблонСсылка);
	Запрос.УстановитьПараметр("ИдШаблона", ИдШаблона);
	Запрос.УстановитьПараметр("ПустойЯзык", Справочники.iga_ЯзыкиЧатов.ПустаяСсылка());
	Запрос.УстановитьПараметр("КартинкаШаблона", КартинкаШаблона);
	
	ЯзыкЧата = iga_МетодыРаботыСБотом.ПолучитьЗначениеПараметраОбщения(ЧатСсылка, "Язык", Справочники.iga_ЯзыкиЧатов.Русский);
	Запрос.УстановитьПараметр("Язык", ЯзыкЧата);
	
	ПакетРезультатов = Запрос.ВыполнитьПакет();
	ВыборкаШаблон = ПакетРезультатов.Получить(1).Выбрать();
	Если Не ВыборкаШаблон.Следующий() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВыборкаПараметры = ПакетРезультатов.Получить(2).Выбрать();
	
	Бот = Обработки.iga_ChatBot.Создать();
	Бот.ИнициализацияОсновныхПараметров();
	
	ПереченьПараметров = Новый Массив;
	ВходящиеПараметры.Вставить("ПереченьПараметров", ПереченьПараметров);
	Если ВыборкаШаблон.ТипСодержимого = Перечисления.iga_ТипыСодержимогоШаблона.Изображение Тогда
		ВходящиеПараметры.Вставить("СсылкаНаИзображение", ВыборкаШаблон.СсылкаНаИзображение);
	КонецЕсли;
	ВходящиеПараметры.Вставить("Чат", ЧатСсылка);
	ВходящиеПараметры.Вставить("ТекстСообщения", ВыборкаШаблон.ТекстСообщения);
	
	ОбработчикЭтапов = Обработки.iga_ОбработчикЭтапов.Создать();
	ОбработчикЭтапов.ВходящиеПараметры = ВходящиеПараметры;
	
	Если Не ВыборкаШаблон.АлгоритмПодготовки = "" Тогда
		ОбработчикЭтапов.ВыполнитьОбработчикСУчетомАлгоритмов(ВыборкаШаблон.АлгоритмПодготовки);
	КонецЕсли;
	
	ИсходноеСоответствиеПараметров = Новый Соответствие;
	
	СоответствиеПараметров = Новый Соответствие;
	
	Пока ВыборкаПараметры.Следующий() Цикл
		
		Если ТипЗнч(ВыборкаПараметры.ЗначениеИсточник) = Тип("СправочникСсылка.iga_Алгоритмы") Тогда
			РезультатВычисления = ОбработчикЭтапов.ВыполнитьАлгоритмВИсключении(ВыборкаПараметры.ЗначениеИсточник);
			
			ИсходноеСоответствиеПараметров.Вставить(Сред(ВыборкаПараметры.ИмяПараметра, 2, СтрДлина(ВыборкаПараметры.ИмяПараметра)-2), РезультатВычисления);

		Иначе
			
			ИсходноеСоответствиеПараметров.Вставить(Сред(ВыборкаПараметры.ИмяПараметра, 2, СтрДлина(ВыборкаПараметры.ИмяПараметра)-2), ВыборкаПараметры.ЗначениеИсточник);

		КонецЕсли;
	КонецЦикла;

	ВходящиеПараметры.Вставить("ПараметрыШаблона", ИсходноеСоответствиеПараметров);
	
	Если ВходящиеПараметры.Свойство("АлгоритмПодготовки") Тогда
		ОбработчикЭтапов.ВыполнитьАлгоритмВИсключении(ВходящиеПараметры.АлгоритмПодготовки);
	КонецЕсли;                    
	
	Для Каждого Параметр Из ИсходноеСоответствиеПараметров Цикл
		 СоответствиеПараметров.Вставить("{" + Параметр.Ключ + "}", Параметр.Значение);
	КонецЦикла;
	
	ТекстСообщения = ОбработчикЭтапов.ВходящиеПараметры.ТекстСообщения;
	
	ТекстДляЗамены = ТекстСообщения;
	
	СчетчикПараметров = 0;
	
	СтруктураПоиска = Новый Структура("ИмяПараметра");
	
	Пока Истина Цикл
		
		НайденноеЗначение = СтрНайтиПоРегулярномуВыражению(ТекстДляЗамены, "(?<!\{)\{[^{}]+\}(?!\})");
		Если НайденноеЗначение.НачальнаяПозиция = 0 Тогда
			Прервать;
		КонецЕсли;
		СчетчикПараметров = СчетчикПараметров + 1;
		
		ДлинаПараметра =  НайденноеЗначение.Длина;
		ЛеваяЧасть = Лев(ТекстДляЗамены, НайденноеЗначение.НачальнаяПозиция - 1);
		
		Центр = "{{" + СчетчикПараметров + "}}";
		
		ПраваяЧасть = Прав(ТекстДляЗамены, СтрДлина(ТекстДляЗамены) - (НайденноеЗначение.НачальнаяПозиция + ДлинаПараметра - 1));
		
		ТекстДляЗамены = ЛеваяЧасть +  Центр + ПраваяЧасть;
		
		ЗначениеПараметра = СоответствиеПараметров.Получить(НайденноеЗначение.Значение);
		
		Если Не ЗначениеПараметра = Неопределено Тогда
			
			ПереченьПараметров.Добавить(ЗначениеПараметра);
			
			ТекстСообщения = СтрЗаменить(ТекстСообщения,НайденноеЗначение.Значение, ЗначениеПараметра);
		КонецЕсли;

		
	КонецЦикла;
	
	ВыборкаКнопок = ВыборкаШаблон.Кнопки.Выбрать();
	
	ЕстьКнопки =  ВыборкаКнопок.Количество() > 0;
	
	Пока ВыборкаКнопок.Следующий() Цикл
		Если ЗначениеЗаполнено(ВыборкаКнопок.ПараметрКнопки) Тогда
			
			Если ТипЗнч(ВыборкаКнопок.ПараметрКнопки) = Тип("СправочникСсылка.iga_Алгоритмы") Тогда
				ЗначениеПараметра = ОбработчикЭтапов.ВычислитьАлгоритм(ВыборкаКнопок.ПараметрКнопки.Алгоритм, 
					ВыборкаКнопок.ПараметрКнопки.ПараметрыАлгоритма, Новый Массив, ВыборкаКнопок.ПараметрКнопки);
			Иначе
				ЗначениеПараметра = ВыборкаКнопок.ПараметрКнопки;
			КонецЕсли;
			
			ПереченьПараметров.Добавить(ЗначениеПараметра);
		КонецЕсли;
	КонецЦикла;
	
	Если ПростоеСообщение И Не ЕстьКнопки Тогда
		
		Если ВходящиеПараметры.Свойство("СсылкаНаИзображение") Тогда
			Результат = Бот.ОтправитьВидеоАудиоИзображениеДокументПоURL(ИдЧата, ВыборкаШаблон.СсылкаНаИзображение, ТекстСообщения); 			
			
			Если Результат = Неопределено Тогда
				Возврат Результат;
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Невозможно отправить сообщение. Возможно неверный номер, данные отправки некорректны.";
				Сообщение.Сообщить();
			КонецЕсли;
			
			СтруктураСообщения = Новый Структура;
			СтруктураСообщения.Вставить("ЧатСсылка", ЧатСсылка);
			СтруктураСообщения.Вставить("ИдЧата", ИдЧата);
			СтруктураСообщения.Вставить("IDСообщения", Результат.idMessage);
			СтруктураСообщения.Вставить("Текст", ТекстСообщения);
			СтруктураСообщения.Вставить("Тип", "imageMessage");
			СтруктураСообщения.Вставить("ВходящееСообщение", Ложь);
			СтруктураСообщения.Вставить("IDЦитируемогоСобщения", "");
			СтруктураСообщения.Вставить("ТекстЦитирования", "");
			СтруктураСообщения.Вставить("АвторЦитирования", "");
			СтруктураСообщения.Вставить("СсылкаОператор");
			СтруктураСообщения.Вставить("Прочитано", Ложь);
			СтруктураСообщения.Вставить("ЕстьФайл", Истина);
			СтруктураСообщения.Вставить("СсылкаНаФайл", ВыборкаШаблон.СсылкаНаИзображение);
			СтруктураСообщения.Вставить("КартинкаФайла", "");
			СтруктураСообщения.Вставить("ИмяФайла", "file.file");
			СтруктураСообщения.Вставить("РазмерФайла", 0);
			
			ТекущаяВременнаяМетка = Бот.ЗаписатьВИсторию(СтруктураСообщения);
			
			СтруктураВозврата = Новый Структура("IDСообщения, Текст, Дата, ТекущаяВременнаяМетка",
				Результат.idMessage, ТекстСообщения, ТекущаяДата(), ТекущаяВременнаяМетка);
		Иначе
			СтруктураВозврата = Бот.ОтправитьПростоеСообщение(ЧатСсылка, ИдЧата, ТекстСообщения);
		КонецЕсли;
	Иначе 
		
		Результат = Бот.ОтправитьШаблонноеСообщениеПользоватлю(ИдЧата, ВыборкаШаблон.ИдШаблона, ВходящиеПараметры);
		
		Если ТипЗнч(Результат) = Тип("Строка") Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Невозможно отправить сообщение. Возможно неверный номер, данные отправки некорректны.";
			Сообщение.Сообщить();
			
			ЗаписьЖурналаРегистрации("Green API: Отправка шаблона", УровеньЖурналаРегистрации.Ошибка,
				Метаданные.Справочники.iga_ШаблоныСообщений.МодульМенеджера,, Результат); 
			
			Возврат Неопределено;
		КонецЕсли;
		
		СтруктураСообщения = Новый Структура;
		СтруктураСообщения.Вставить("ЧатСсылка", ЧатСсылка);
		СтруктураСообщения.Вставить("ИдЧата", ИдЧата);
		СтруктураСообщения.Вставить("IDСообщения", Результат.idMessage);
		СтруктураСообщения.Вставить("Текст", ТекстСообщения);
		СтруктураСообщения.Вставить("Тип", "interactiveButtons");
		СтруктураСообщения.Вставить("ВходящееСообщение", Ложь);
		СтруктураСообщения.Вставить("IDЦитируемогоСобщения", "");
		СтруктураСообщения.Вставить("ТекстЦитирования", "");
		СтруктураСообщения.Вставить("АвторЦитирования", "");
		СтруктураСообщения.Вставить("СсылкаОператор");
		СтруктураСообщения.Вставить("Прочитано", Ложь);
		
		ТекущаяВременнаяМетка = Бот.ЗаписатьВИсторию(СтруктураСообщения);
		
		СтруктураВозврата = Новый Структура("IDСообщения, Текст, Дата, ТекущаяВременнаяМетка",
			Результат.idMessage, ТекстСообщения, ТекущаяДата(), ТекущаяВременнаяМетка);

	КонецЕсли;
	
	Если Не ВыборкаШаблон.АлгоритмПослеОтправки = "" И Не ТипЗнч(Результат) = Тип("Строка") Тогда
		
		ОбработчикЭтапов.ВходящиеПараметры.Вставить("ИдСообщения", Результат.idMessage);
		ОбработчикЭтапов.ВыполнитьОбработчикСУчетомАлгоритмов(ВыборкаШаблон.АлгоритмПослеОтправки);
	КонецЕсли;
	
	Возврат СтруктураВозврата
	
КонецФункции

Функция ПолучитьТекстШаблонаПоПараметрам(ИдШаблона, Параметры) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	iga_ШаблоныСообщений.ТекстСообщения КАК ТекстСообщения
	               |ИЗ
	               |	Справочник.iga_ШаблоныСообщений КАК iga_ШаблоныСообщений
	               |ГДЕ
	               |	iga_ШаблоныСообщений.Идентификатор = &Идентификатор";
	Запрос.УстановитьПараметр("Идентификатор", ИдШаблона);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	ТекстСообщения = Выборка.ТекстСообщения;
	
	СчетчикПараметров = -1;
	
	Пока Истина Цикл
		
		НайденноеЗначение = СтрНайтиПоРегулярномуВыражению(ТекстСообщения, "(?<!\{)\{[^{}]+\}(?!\})");
		Если НайденноеЗначение.НачальнаяПозиция = 0 Тогда
			Прервать;
		КонецЕсли;
		СчетчикПараметров = СчетчикПараметров + 1;
		
		ДлинаПараметра =  НайденноеЗначение.Длина;
		ЛеваяЧасть = Лев(ТекстСообщения, НайденноеЗначение.НачальнаяПозиция - 1);
		
		Центр = Параметры.Получить(СчетчикПараметров);
		
		ПраваяЧасть = Прав(ТекстСообщения, СтрДлина(ТекстСообщения) - (НайденноеЗначение.НачальнаяПозиция + ДлинаПараметра - 1));
		
		ТекстСообщения = ЛеваяЧасть +  Центр + ПраваяЧасть;
		
	КонецЦикла;
	
	Возврат ТекстСообщения;
	
КонецФункции

Функция Предопределенный(Перечисление, Язык = Неопределено) Экспорт
	
	Если Язык = Неопределено Тогда
		Язык = Справочники.iga_ЯзыкиЧатов.Русский;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	iga_ПредопределенныеШаблоны.Шаблон КАК Шаблон,
	               |	0 КАК Порядок
	               |ИЗ
	               |	РегистрСведений.iga_ПредопределенныеШаблоны КАК iga_ПредопределенныеШаблоны
	               |ГДЕ
	               |	iga_ПредопределенныеШаблоны.ВидШаблона = &ВидШаблона
	               |	И iga_ПредопределенныеШаблоны.Язык = &Язык
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	iga_ПредопределенныеШаблоны.Шаблон,
	               |	1
	               |ИЗ
	               |	РегистрСведений.iga_ПредопределенныеШаблоны КАК iga_ПредопределенныеШаблоны
	               |ГДЕ
	               |	iga_ПредопределенныеШаблоны.ВидШаблона = &ВидШаблона
	               |	И iga_ПредопределенныеШаблоны.Язык = &ПустойЯзык
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Порядок";
	Запрос.УстановитьПараметр("ВидШаблона", Перечисление);
	Запрос.УстановитьПараметр("Язык", Язык);
	Запрос.УстановитьПараметр("ПустойЯзык", Справочники.iga_ЯзыкиЧатов.ПустаяСсылка());
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Шаблон;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьНомерКнопки(ИдШаблона, ТекстКнопки) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	iga_ШаблоныСообщенийКнопки.НомерСтроки КАК НомерСтроки,
	               |	iga_ШаблоныСообщений.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.iga_ШаблоныСообщений.Кнопки КАК iga_ШаблоныСообщенийКнопки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.iga_ШаблоныСообщений КАК iga_ШаблоныСообщений
	               |		ПО iga_ШаблоныСообщенийКнопки.Ссылка = iga_ШаблоныСообщений.Ссылка
	               |ГДЕ
	               |	iga_ШаблоныСообщений.Идентификатор = &Идентификатор
	               |	И iga_ШаблоныСообщенийКнопки.Заголовок = &Заголовок";
	Запрос.УстановитьПараметр("Идентификатор", ИдШаблона);
	Запрос.УстановитьПараметр("Заголовок", ТекстКнопки);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.НомерСтроки;
	Иначе
		Возврат 0;
	КонецЕсли;
КонецФункции
